//[]內有*之項目可任意修改
//其餘項目需與測試程式搭配，不得任意修改(等號右邊之敘述除外)

[ManualTest]
2=MT43,FW錯誤
5=MT02,VID&PID不良
7=CS07,DEVICE_DISCONNECTED
8=CS08,USER_CANCEL
9=CS08,KEYBOARD_FAIL
11=MT07,畫圓不良
13=CS13,PCBA_FAIL
14=CS14,REPORT_RATE_FAIL
18=CS18,BUTTON_FAIL
19=CS19,WHEEL_FAIL
20=MT32,DPI燈切換不良
21=MT38,燈不良
22=CS22,NOT_FOUND_HP34401A
23=MT18,電流不良
24=MT13,連KEY
25=CS25,LINE_DPI_1_FAIL
26=CS26,LINE_DPI_2_FAIL
27=CS27,LINE_DPI_1_OFFSET_FAIL
28=CS28,LINE_DPI_1_OFFSET_FAIL

[*ManualTest]
MT03,無法識別NF
MT43,FW錯誤
MT05,左Key電性不良
MT15,右Key電性不良
MT09,3D下壓電性不良
MT12,DPI電性不良
MT68,左前側KEY電性
MT69,左後側KEY電性
MT13,連KEY
MT06,3D滾動不良
MT32,DPI燈切換不良
MT07,畫圓不良
MT08,無線條
MT57,左KEY手感
MT58,右KEY手感
MT59,3D下壓手感
MT60,3D滾動手感
MT61,左前側KEY手感
MT62,左後側KEY手感
MT65,DPI前KEY手感

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[PCBA1]
2=MT43,FW錯誤
5=MT02,VID&PID不良
8=CS08,USER_CANCEL
9=CS08,KEYBOARD_FAIL
11=MT07,畫圓不良
13=CS13,PCBA_FAIL
14=CS14,REPORT_RATE_FAIL
18=CS18,BUTTON_FAIL
19=CS19,WHEEL_FAIL
20=MT32,DPI燈切換不良
21=MT38,燈不良
22=CS22,NOT_FOUND_HP34401A
23=MT18,電流不良
24=MT13,連KEY

[*PCBA1]
MT03,無法識別NF
MT43,FW錯誤
MT18,電流不良
MT05,左Key電性不良
MT15,右Key電性不良
MT09,3D下壓電性不良
MT12,DPI電性不良
MT68,左前側KEY電性
MT69,左後側KEY電性
MT13,連KEY
MT06,3D滾動不良
MT32,DPI燈切換不良


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[PCBA2]
2=MT43,FW錯誤
5=MT02,VID&PID不良
8=CS08,USER_CANCEL
9=CS08,KEYBOARD_FAIL
11=MT07,畫圓不良
13=CS13,PCBA_FAIL
14=CS14,REPORT_RATE_FAIL
18=CS18,BUTTON_FAIL
19=CS19,WHEEL_FAIL
20=MT32,DPI燈切換不良
21=MT38,燈不良
22=CS22,NOT_FOUND_HP34401A
23=MT18,電流不良
24=MT13,連KEY

[*PCBA2]
MT03,無法識別NF
MT12,DPI電性不良
MT68,左前側KEY電性
MT69,左後側KEY電性
MT13,連KEY
MT20,3D燈不亮
MT21,3D燈異色


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[RGB_LED]
2=MT43,FW錯誤
5=MT02,VID&PID不良
8=CS08,USER_CANCEL
9=CS08,KEYBOARD_FAIL
11=MT07,畫圓不良
13=CS13,PCBA_FAIL
14=CS14,REPORT_RATE_FAIL
18=CS18,BUTTON_FAIL
19=CS19,WHEEL_FAIL
20=MT32,DPI燈切換不良
21=MT38,燈不良
22=CS22,NOT_FOUND_HP34401A
23=MT18,電流不良
24=MT13,連KEY

[*RGB_LED]
MT03,無法識別NF
MT20,3D燈不亮
MT21,3D燈異色
MT22,LOGO燈不亮
MT23,LOGO燈異色
MT40,漏光不良
MT42,RGB異色
